RhinoInside.Revit API Documentation
GeometryEncoder.ToSolid Method (SubD)
 Converts the specified Rhino.Geometry.SubD to an equivalent of Autodesk.Revit.DB.Solid.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Solid ToSolid(
	this Rhino.Geometry.SubD subd
)
@staticmethod
def ToSolid(
	subd: Rhino.Geometry.SubD
) -> Autodesk.Revit.DB.Solid
Parameters
subd
Type: Rhino.Geometry.SubD
Rhino subd to convert.
Return Value
Type: Autodesk.Revit.DB.Solid
Revit solid that is equivalent to the provided Rhino subd.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.SubD. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToSolid(SubD) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Solid revitSolid = rhinoSubD.ToSolid();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_solid = rhino_subd.ToSolid()    # type: DB.Solid
 Using ToSolid(SubD) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Solid revitSolid = GeometryEncoder.ToSolid(rhinoSubD);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_solid = GE.ToSolid(rhino_subd)    # type: DB.Solid
See Also
Reference
GeometryEncoder Class
ToSolid Overload
RhinoInside.Revit.Convert.Geometry Namespace